[
  {
    "name": "Matthew J Roybal",
    "date": "March 2023",
    "avatar": "M",
    "text": "Marcus did an awesome job. He is a fantastic with NextJS. If you have questions about using this framework, definitely hit him up!"
  },
  {
    "name": "Yung Ym Mac",
    "date": "January 2023",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/I54gRFi2QcSPEac2jmyN",
    "text": "marcus was very insightful and gave me a lot of insight on the roadblocks I came across. I strongly recommend his services."
  },
  {
    "name": "Jennifer Roques",
    "date": "January 2023",
    "avatar": "https://www.gravatar.com/avatar/d22deb466f6e2be284cdf36f95570485?d=404&s=200",
    "text": "Marcus is awesome! I received information on best practices, how to improve my code and we were able to troubleshoot a problem quickly."
  },
  {
    "name": "scott ",
    "date": "January 2023",
    "avatar": "S",
    "text": "He was a great teacher - knowledgeable, patient and always had helpful tips. He made the learning process enjoyable and understandable."
  },
  {
    "name": "Anya Velez",
    "date": "January 2023",
    "avatar": "https://ucarecdn.com/dd401dbd-f1e9-42b7-bc80-10770b610f87/-/crop/1182x547/0,0/-/preview/",
    "text": "Marcus was great! I appreciate his knowledge on react and css. He was very patient and I would definitely book another session for debugging or mentoring. Thank you :)"
  },
  {
    "name": "William Flanagan",
    "date": "December 2022",
    "avatar": "https://lh6.googleusercontent.com/-4kUcxnBTjIo/AAAAAAAAAAI/AAAAAAAAAMg/CT8BdQoXAoY/photo.jpg",
    "text": "He was very thorough in his explanations and provided great insight into the topic. His expertise was obvious and it was evident he was well-versed in the subject matter."
  },
  {
    "name": "pat",
    "date": "December 2022",
    "avatar": "P",
    "text": "He's an absolute expert on React and Tailwind - very knowledgeable and always willing to help. Highly recommend!"
  },
  {
    "name": "Julien Jacquet",
    "date": "December 2022",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/orGeaF0OSlKxCSsfk2NS",
    "text": "Awesome. Super competent, fast and communicates clearly and often and very available. Highly recommended."
  },
  {
    "name": "BreakDown",
    "date": "December 2022",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/4lPzd5XNRk2hcSBat7Bf",
    "text": "Marcus is an experienced and well-thought-out frontend developer. He has a deep understanding of modern web development principles and can create efficient and user-friendly interfaces for web applications. He also has strong debugging and problem-solving skills that make him an effective collaborator. Marcus is an asset to any development team and I highly recommend him."
  },
  {
    "name": "Isaac Yerushalmi",
    "date": "June 2020",
    "avatar": "I",
    "text": "Marcus was incredibly knowledgeable and patient in guiding me through the entire process. He provided invaluable insight and advice throughout, and was instrumental in helping me create an effective plan for my app."
  },
  {
    "name": "Jim Maybee",
    "date": "June 2020",
    "avatar": "J",
    "text": "Marcus is excellent.  He created a QR scanner app very quickly.  I look forward to ongoing projects.  Highly recommended."
  },
  {
    "name": "Jim Maybee",
    "date": "June 2020",
    "avatar": "J",
    "text": "I was blown away by Marcus's quick work! He was able to set up a QRCode reader in a mere 30 minutes. His work was efficient and precise. I will definitely be using him again in the future."
  },
  {
    "name": "William Cox",
    "date": "May 2020",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/avdMUFodRPKTKaDkPKk1",
    "text": "Marcus is an expert, and fast.  Top of the line and a great teacher as well.  He is the first person I will hire again in the future."
  },
  {
    "name": "Igor Tatarinov",
    "date": "January 2020",
    "avatar": "https://ucarecdn.com/23266875-b584-494d-9b9f-7f1be1ab110a/-/preview/",
    "text": "This guy knows his stuff! He's got the experience and know-how to back up his claims. Highly recommend!"
  },
  {
    "name": "leslie diane",
    "date": "October 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/65jLyg6PRKGrNslRCwQi",
    "text": "Marcus is a great debugger. He takes charge and knows how to get to the root of the problem quickly. Knows all the tricks of the craft."
  },
  {
    "name": "successsalon successsalon",
    "date": "October 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "Another amazing session with Marcus. super quick with excellent communication in understanding the issue and offering multi solutions. Couldn't be happier with the service."
  },
  {
    "name": "successsalon successsalon",
    "date": "October 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "Amazing debugger, and great at explaining how we got to root of the problem and proposing different solutions."
  },
  {
    "name": "Andre",
    "date": "October 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/13W6jrDIRButxx1liwHD",
    "text": "Very informative and an excellent explainer - clear and concise explanations that make it easy to understand!"
  },
  {
    "name": "Matt Jennings",
    "date": "October 2019",
    "avatar": "https://www.gravatar.com/avatar/61a49016b2e326b5d864d025eccc31bd?d=404&s=200",
    "text": "He was extremely helpful and went above and beyond to ensure that the problem was solved quickly and effectively."
  },
  {
    "name": "Matt Jennings",
    "date": "September 2019",
    "avatar": "https://www.gravatar.com/avatar/61a49016b2e326b5d864d025eccc31bd?d=404&s=200",
    "text": "He was extremely knowledgeable and patient in his explanation of AJAX. He made a complex concept very easy to understand."
  },
  {
    "name": "Jeff Carroll",
    "date": "September 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/1b8B1iVvRiaFbrhGFtuQ",
    "text": "Marcus was an amazing asset to our team, stepping up and filling the shoes of a lost developer. He exceeded expectations and did an outstanding job!"
  },
  {
    "name": "John Smith",
    "date": "August 2019",
    "avatar": "https://www.gravatar.com/avatar/c87983dea3f7efa12b1600c66eeb246b?d=404",
    "text": "Ive known about Marcus for a while through his React courses, I reached out to him to help me start architecting an app I am building as a side project. He was awesome! I got answers to alot of the areas of this project that I was unfamiliar with and we planned out a way to get the project going. Really looking forward to continuing to work with him."
  },
  {
    "name": "Jeff Carroll",
    "date": "August 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/1b8B1iVvRiaFbrhGFtuQ",
    "text": "Marcus completed a project for us within a short amount of time. His code was excellent and he always confirmed we understood his work for the handoff."
  },
  {
    "name": "Jeff Carroll",
    "date": "August 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/1b8B1iVvRiaFbrhGFtuQ",
    "text": "Marcus worked on freelance projects for us. He was flexible and communicated well. His coding was excellent and he made sure we understood what he was doing."
  },
  {
    "name": "Jeff Carroll",
    "date": "August 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/1b8B1iVvRiaFbrhGFtuQ",
    "text": "Marcus has been an excellent mentor. He asks clear questions, checks that we understand what he doing, and is prompt with his sessions. Highly recommend him."
  },
  {
    "name": "Jeff Carroll",
    "date": "August 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/1b8B1iVvRiaFbrhGFtuQ",
    "text": "He is very knowledgeable and patient, always ready to answer questions and provide guidance. He is a great resource and I highly recommend him as a mentor."
  },
  {
    "name": "KathChalmers",
    "date": "August 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/icJL90OOQTq9mPXx3v4S",
    "text": "He's also very professional and reliable. He always gets the job done on time and to a very high standard. Highly recommended!"
  },
  {
    "name": "Daniel",
    "date": "July 2019",
    "avatar": "D",
    "text": "Another awesome session!! Marcus is great explaining everything in a very easy to understand way, thanks!!"
  },
  {
    "name": "Daniel",
    "date": "July 2019",
    "avatar": "D",
    "text": "It was great to see you again! Thanks for the amazing session. It was so informative and enjoyable!"
  },
  {
    "name": "Daniel",
    "date": "July 2019",
    "avatar": "D",
    "text": "Best session and mentor!! Marcus identifies very quickly the best solution and the best logic and makes sure to explains in detail everything, thank you!!"
  },
  {
    "name": "lpp",
    "date": "July 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/SH1CwO4Q1iJbZ6ky1WN7",
    "text": "Marcus is great, very helpful and knowledgeable. We looked at React and Javascript problems which Marcus was able to solve."
  },
  {
    "name": "Jelena Grimshaw",
    "date": "June 2019",
    "avatar": "J",
    "text": "Marcus has a wealth of knowledge and expertise that is hard to find. Perfect mentor in many ways: clear and concise communication, reliable and a great teacher. I highly recommend working with him if you need help."
  },
  {
    "name": "Jelena Grimshaw",
    "date": "June 2019",
    "avatar": "J",
    "text": "he was an amazing instructor who provided clear guidance and support throughout my horror rails project. I'm so grateful for her help and patience!"
  },
  {
    "name": "Jelena Grimshaw",
    "date": "June 2019",
    "avatar": "J",
    "text": "Marcus is an incredible developer! He saved us from certain disaster and we are so grateful for his help. Highly recommend!"
  },
  {
    "name": "Daniel Star",
    "date": "June 2019",
    "avatar": "https://lh4.googleusercontent.com/-4c-OVI8O8B4/AAAAAAAAAAI/AAAAAAAAAEM/KiYUtNhhNJI/photo.jpg",
    "text": "Wow, Marcus has really proved himself to be an expert in many ways. Definitely worth the investment and here's why:\nPros: He works really fast, gave me some really helpful tips, explained me everything through meaningful examples and even improved some parts of already existing code in a way which makes them more clean and usable.\nCons: I only wish the session was longer as I am looking forward to another one :)"
  },
  {
    "name": "Dinesh Mittal",
    "date": "June 2019",
    "avatar": "D",
    "text": "Excellent, Really helped me and have given me new information.  If you want to become a professional in React or regular JavaScript, then look no further..."
  },
  {
    "name": "Adam Stockland",
    "date": "May 2019",
    "avatar": "https://www.gravatar.com/avatar/1309fa08e230c6cbe9a2b27964a40516?d=404&s=200",
    "text": "I’ve used Marcus a couple times. He is awesome!  I’ve been using Rails, etc for 7+ years but I still get hung up once in a while...Marcus knows his $h!.  I won’t search for mentors anymore...I’ll just use Marcus."
  },
  {
    "name": "Liu Xia",
    "date": "May 2019",
    "avatar": "R",
    "text": "Provides an accessible and easy to follow road map for long-term mentees to understand and progress in their learning."
  },
  {
    "name": "karen",
    "date": "May 2019",
    "avatar": "K",
    "text": "his coaching is awesome! It exceeded my expectations in every way and I will definitely be recommending it to others. It's a great value and I'm so glad I decided to give it a try."
  },
  {
    "name": "karen",
    "date": "May 2019",
    "avatar": "K",
    "text": "Javascript Super Star is an amazing resource for anyone looking to become a Javascript expert! It is packed full of helpful tutorials and practical examples that make learning the language easy and fun! Highly recommended!"
  },
  {
    "name": "John Smith",
    "date": "May 2019",
    "avatar": "R",
    "text": "Marcus really knows his code. TDIL why implementing certain react features is preferred,  and how certain design decisions are more performant. Marcus is an interesting coder and skilled at teaching. I recommend him to anyone."
  },
  {
    "name": "Hiroshi",
    "date": "May 2019",
    "avatar": "https://www.gravatar.com/avatar/860c41b199dd6bffdc37b0c9f9dfc2e9?d=404",
    "text": "Excellent work - delivered on-time and on-budget. Very organized and detail-oriented. Great communicator who was always available and quick to respond. Sharp problem-solving skills and very clear instructions. Highly recommended!"
  },
  {
    "name": "Masud",
    "date": "April 2019",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "The team worked diligently on redis improvements and achieved great results. They improved performance and reliability, making redis a great choice for our application."
  },
  {
    "name": "Masud",
    "date": "April 2019",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "The food was fantastic! The service was also great and the atmosphere was really nice. Definitely worth a visit!"
  },
  {
    "name": "successsalon successsalon",
    "date": "March 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "I highly recommend working with Marcus. He is an invaluable asset and his knowledge is second to none."
  },
  {
    "name": "successsalon successsalon",
    "date": "March 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "He's an amazing person and an incredible mentor. His passion and enthusiasm for his work is truly inspiring. He's been a great help and always willing to lend a hand. Highly recommend him!"
  },
  {
    "name": "successsalon successsalon",
    "date": "March 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "The service was top-notch! The communicator was efficient and knowledgeable . Very happy with the purchase."
  },
  {
    "name": "successsalon successsalon",
    "date": "March 2019",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "He's a great teacher, with excellent communication skills. Highly recommend him for anyone looking to learn something new!"
  },
  {
    "name": "Igor Komolov",
    "date": "February 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/D1qNxHVPSxeGRnEWIpE9",
    "text": "I am very pleased with the level of expertise and professionalism this service provided. Excellent communication, ethic and knowledge were displayed throughout the process. Highly recommend!"
  },
  {
    "name": "Edwin van Brenkelen",
    "date": "February 2019",
    "avatar": "E",
    "text": "I love it! Always reliable and top notch quality. Definitely recommend to anyone who needs it!"
  },
  {
    "name": "Ryan",
    "date": "January 2019",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus has been an invaluable resource in helping me grow professionally over the past 6 months. He is knowledgeable, patient and always willing to go the extra mile to ensure I have the tools and resources to succeed. Highly recommend!"
  },
  {
    "name": "Matt Jennings",
    "date": "January 2019",
    "avatar": "https://www.gravatar.com/avatar/61a49016b2e326b5d864d025eccc31bd?d=404&s=200",
    "text": "I liked the explanations of ReactJS code and the tip of providing a video of how to deploy to GitHub pages."
  },
  {
    "name": "Stephen Huh",
    "date": "January 2019",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/xNFUAvDnRs6OSIKAgK21",
    "text": "I usually have more conceptual questions on Codementor and Marcus came in with a good idea of what it was that I was very confused about and was quick to direct me to the concepts that I was missing.\n\nWe discussed ActiveRecord (pattern, not gem).\nWhat to pass in a RESTful API to reduce cognitive load\nWhen to use objects and when to use serialized IDs as function parameters."
  },
  {
    "name": "Alain Fontaine",
    "date": "January 2019",
    "avatar": "A",
    "text": "Great session with Marcus trying to figure out how to improve our Google page speed score through optimizing the webpack javascript bundles."
  },
  {
    "name": "Masud",
    "date": "January 2019",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "This project was a great success! We were able to write a tmp file and save it to the S3 database quickly and easily. The process was efficient and straightforward. We are delighted with the results!"
  },
  {
    "name": "Adam Harris",
    "date": "January 2019",
    "avatar": "A",
    "text": "Just had my first session with Marcus and it was great! Superb knowledge of react.js and rails, and how the two can work together. Really enjoyed it - highly recommended!"
  },
  {
    "name": "Ryan",
    "date": "December 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus is great to work with! He's very knowledgeable and always puts in extra effort to make sure the job is done right. Highly recommend!"
  },
  {
    "name": "Travis Spire-Sweet",
    "date": "December 2018",
    "avatar": "T",
    "text": "A pleasure to work with. Highly recommend for any Node.js development needs. Will definitely be keeping this in my go-to list."
  },
  {
    "name": "successsalon successsalon",
    "date": "December 2018",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "His insights are invaluable and his ability to explain complex ideas in simple terms is remarkable. He's an expert in his field and it's easy to see why. He's definitely someone worth learning from!"
  },
  {
    "name": "successsalon successsalon",
    "date": "December 2018",
    "avatar": "https://ucarecdn.com/5a953f00-4bff-4753-a06c-da87bc19bad4/",
    "text": "He's a coding superstar! No matter the language, he gets the job done quickly and perfectly. Rails and React? No sweat for this guy!"
  },
  {
    "name": "Norma Scannell",
    "date": "December 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/HZ9DKwDNTyuc6flzfkC6",
    "text": "Marcus is a great resource, full of knowledge and experience! I highly recommend working with him. He is an invaluable asset!"
  },
  {
    "name": "intelijens",
    "date": "December 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/NkZjFiC8QZeOx4Xz1wxN",
    "text": "Marcus was very quick and helpful and he definitely  knows his science, language and frameworks.  I highly recommend him.  Value > price, all day. Tellez FTW"
  },
  {
    "name": "Jack Bordner",
    "date": "December 2018",
    "avatar": "J",
    "text": "Marcus has been helping us daily with our website for about a week now and I would confidently recommend him to any peer looking for someone who is a fast developer, strong communicator and honest worker. "
  },
  {
    "name": "Masud",
    "date": "November 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "I had the opportunity to work on saving canvas images as base64 to the database. It was a great experience and I learned a lot about the process and how to optimize it for better performance."
  },
  {
    "name": "Ryan",
    "date": "October 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus is a great employee who consistently delivers outstanding results. He is reliable, hardworking, and always goes the extra mile. Highly recommend!"
  },
  {
    "name": "BoucherieDev 💾",
    "date": "October 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/7bT5ibsoR8SM4LCZnK90",
    "text": "Really great! Marcus walked me through a tricky issue I was basing off of legacy code, and came up with a much more intuitive workaround I can jump off from. Both of the issues I posted for help about were solved, and I came away with a decent toolkit to deal with some performance issues in both my code and my computer."
  },
  {
    "name": "Taylor Melnik",
    "date": "October 2018",
    "avatar": "T",
    "text": "The issue was quickly and effectively handled. All questions and concerns were addressed in a timely manner. Highly recommended!"
  },
  {
    "name": "Rajesh",
    "date": "October 2018",
    "avatar": "R",
    "text": "He is incredibly talented and reliable. We are confident that he will be able to handle any task we throw at him and that we will have a successful long-term partnership."
  },
  {
    "name": "Marcus Cates ",
    "date": "October 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/NzCxXXsdRJaYY8mQ2EFC",
    "text": "He is very knowledgeable and always willing to go the extra mile. He provides quality service with amazing speed and accuracy. Highly recommend!"
  },
  {
    "name": "Mitchell Gould",
    "date": "October 2018",
    "avatar": "M",
    "text": "Marcus came through for me. He knew how to target my problem and rethink it so that I could attack it from a much easier angle. Excellent mentor."
  },
  {
    "name": "Abram Coetsee",
    "date": "October 2018",
    "avatar": "A",
    "text": "This is the best ruby help I've ever found. It's clear, concise, and easy to understand. Highly recommended for anyone looking to learn ruby!"
  },
  {
    "name": "Ryan",
    "date": "September 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "As usual, you did an amazing job! Your hard work and dedication to the task really shows. You should be proud of the results you achieved."
  },
  {
    "name": "Ryan",
    "date": "September 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "The feature was definitely challenging, yet you worked on it with ease! Top-notch job - great job as always!"
  },
  {
    "name": "Masud",
    "date": "August 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "He was very knowledgeable and patient in helping me solve the issue. His guidance was invaluable in understanding the performance implications of my code. Highly recommended!"
  },
  {
    "name": "Masud",
    "date": "August 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "Marcus is an amazing coach! He's always friendly and extremely helpful. No matter what issue I bring to him, he always manages to help me find a solution. Highly recommend!"
  },
  {
    "name": "Ashley",
    "date": "July 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/Erb7YijWQDyMR4W609PZ",
    "text": "Marcus is so good at JavaScript and React (and Redux). He immediately knows how to address the task at hand and then starts throwing down code. I really appreciate his positive attitude and the time he takes to walk me through the work."
  },
  {
    "name": "Courtney Eimerman-Wallace",
    "date": "July 2018",
    "avatar": "https://lh4.googleusercontent.com/-zseTzqX0ujs/AAAAAAAAAAI/AAAAAAAAAAo/nbAfnnkSVLA/photo.jpg",
    "text": "He was great at breaking down the problem and helping me find a solution. His advice was invaluable and I'm very thankful for his help."
  },
  {
    "name": "Sam",
    "date": "July 2018",
    "avatar": "S",
    "text": "Marcus was very helpful in debugging a React/Redux issue. He quickly isolated an issue and that helped uncover some other problems that needed attention. He also helped after the session by providing links and references to other skilled devs."
  },
  {
    "name": "Carl Amess",
    "date": "July 2018",
    "avatar": "C",
    "text": "My First session with Marcus as a complete novice when it comes to developing.  But I am confident that we can work on my education and project together for a long time to come."
  },
  {
    "name": "VDP",
    "date": "June 2018",
    "avatar": "V",
    "text": "Marcus was helpful as usual! He did a great job explaining concepts and making them easy to understand."
  },
  {
    "name": "Ryan",
    "date": "May 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "his coaching was simply amazing! The quality and design were top-notch, and it exceeded my expectations. Highly recommend!"
  },
  {
    "name": "Lindsey Ramirez",
    "date": "May 2018",
    "avatar": "https://www.gravatar.com/avatar/3f12cbabacb0e104c94f0e439abba60e?d=404&s=200",
    "text": "As always, the experience was great! Everything was perfect and I can't wait to come back again."
  },
  {
    "name": "Daniel Levelev",
    "date": "May 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/MtoUdU5aQlqdzk8A4Dpy",
    "text": "He was an excellent mentor who provided invaluable guidance to help me successfully implement the feature. He was always available to answer questions and ensure that I understood the process. Highly recommended!"
  },
  {
    "name": "Lindsey Ramirez",
    "date": "April 2018",
    "avatar": "https://www.gravatar.com/avatar/3f12cbabacb0e104c94f0e439abba60e?d=404&s=200",
    "text": "Marcus is a Rails / React / Programming ninja who goes above & beyond in every session. Totally recommend him to help with whatever you're stuck on!"
  },
  {
    "name": "VDP",
    "date": "April 2018",
    "avatar": "V",
    "text": "He was friendly and patient, and was able to explain the process to me in a way that was easy to understand. He was a great help and I'm thankful for his assistance."
  },
  {
    "name": "Ashley",
    "date": "April 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/Erb7YijWQDyMR4W609PZ",
    "text": "Marcus has helped me several times at this point and is always quick and knowledgeable and writes great code (despite my usual, annoying lack of A/V for our sessions). He's worth the higher price because you know he knows what he's doing! Thanks as always, Marcus!"
  },
  {
    "name": "Ryan",
    "date": "April 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus was very helpful in providing a simple solution for a complex feature. His guidance was invaluable and made the process much easier."
  },
  {
    "name": "Ryan",
    "date": "April 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "His work is outstanding and I highly recommend him. He is reliable, efficient, and very knowledgeable. I'm glad I chose him to handle my needs!"
  },
  {
    "name": "Masud",
    "date": "March 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "Fixed sidekiq and discussed on how to open source my software and let others build stuff on top of mine."
  },
  {
    "name": "Ryan",
    "date": "March 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "He was patient and listened to my ideas, giving great advice and guidance throughout. I highly recommend him as a mentor!"
  },
  {
    "name": "Blair Battenberg",
    "date": "March 2018",
    "avatar": "B",
    "text": "Marcus is an amazing teacher who truly cares about his students. He is patient and knowledgeable, and always willing to help. I highly recommend him!"
  },
  {
    "name": "Daniel",
    "date": "March 2018",
    "avatar": "D",
    "text": "Another awesome session!! Marcus explains the logic very clearly and I can understand it very well. Thanks!!"
  },
  {
    "name": "Masud",
    "date": "March 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "Marcus is a great coach and every session is full of useful information and feedback. He's very knowledgeable and can help you reach your goals. Highly recommend working with him!"
  },
  {
    "name": "cherise knox",
    "date": "March 2018",
    "avatar": "C",
    "text": "Awesome mentor! He explains all of this steps and make sure he understands what you are trying to do."
  },
  {
    "name": "rolando-13",
    "date": "March 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/NyEZckXQQk6NR2wi8wyQ",
    "text": "Best mentor I have hired so far, went straight to point, solve my issue and explain what was going on, brilliant!"
  },
  {
    "name": "Daniel",
    "date": "March 2018",
    "avatar": "D",
    "text": "Marcus was a great teacher and I was able to grasp complex logic quickly. I am very grateful for the helpful session!"
  },
  {
    "name": "Daniel",
    "date": "March 2018",
    "avatar": "D",
    "text": "Another awesome session!! Marcus is the best Rails and Javascript mentor! Explains everything in a very detailed way and makes sure I understand it and know the logic."
  },
  {
    "name": "Jackson Holiday Wheeler",
    "date": "March 2018",
    "avatar": "https://www.gravatar.com/avatar/a8a5219e77087fdb27cbf8796af436b6?d=404&s=200",
    "text": "Fantastic as always. Found the problem and helped me think more like a developer. Marcus is quickly becoming my go-to guy."
  },
  {
    "name": "Ed Wellein",
    "date": "February 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/Dx0pwmKgTKqPzoleTZhm",
    "text": "Marcus was incredibly helpful and had a great attitude. His friendly demeanor made it easy to talk to him and he answered all my questions thoroughly."
  },
  {
    "name": "Jackson Holiday Wheeler",
    "date": "February 2018",
    "avatar": "https://www.gravatar.com/avatar/a8a5219e77087fdb27cbf8796af436b6?d=404&s=200",
    "text": "Marcus is great. Not only did he solve the problem I had, but before the session began I was having trouble with my screen sharing -- and he actually paused the session and discovered the problem with my computer. Once we fixed my computer, then we started the session and he solved my problem quickly.\n\nMoreover, he's a fun guy and I would enjoy his company regardless."
  },
  {
    "name": "Lauren Dalmas",
    "date": "February 2018",
    "avatar": "https://lh4.googleusercontent.com/-O2-tA4CLEsw/AAAAAAAAAAI/AAAAAAAAAB8/6OM3js0sVE4/photo.jpg",
    "text": "Marcus is an absolute legend - he always knows how to get the job done! He's reliable, hardworking and always up for a challenge. His enthusiasm for life is contagious and he's a great asset to have around."
  },
  {
    "name": "Daniel",
    "date": "February 2018",
    "avatar": "D",
    "text": "Great session!! Marcus is a great mentor and very knowledgeable. I learned how to structure the code in a better way and now I understand it much better."
  },
  {
    "name": "Daniel",
    "date": "February 2018",
    "avatar": "D",
    "text": "Great session!! Very knowledgeable Ruby, Rails and React JS mentor. He helps you understand the different elements in the code in a very clear and easy way. Thanks!!!"
  },
  {
    "name": "Jacob",
    "date": "February 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/X7o8JNazQsmaMvAhKT99",
    "text": "He is patient, understanding and provides helpful advice. He is always willing to go the extra mile to ensure his mentees reach their goals."
  },
  {
    "name": "Vernon Neilly II",
    "date": "February 2018",
    "avatar": "https://lh5.googleusercontent.com/-afQY0gYKTec/AAAAAAAAAAI/AAAAAAAAAIs/n7cnKFBf8dU/photo.jpg",
    "text": "Knowledgeable, many insights and just all around beneficial information. We'll meet again Marcus. We shall meet again!"
  },
  {
    "name": "Brian Gerald",
    "date": "February 2018",
    "avatar": "B",
    "text": "Extremely helpful and informative, not only in fixing my code but explaining some higher level concepts in detail.  Thank you!"
  },
  {
    "name": "Ryan",
    "date": "February 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus is helping me with a side project that involves working with javascript in embeds. I'm learning a lot and he is an awesome instructor."
  },
  {
    "name": "Will",
    "date": "February 2018",
    "avatar": "https://www.gravatar.com/avatar/910de897dbd80f84581ef08a24d2d2c1?d=404&s=200",
    "text": "The service was outstanding! The staff went the extra mile to ensure I was satisfied. Highly recommended!"
  },
  {
    "name": "Masud",
    "date": "February 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "The shopify theme builder clone was a great success! The whole process was smooth and enjoyable. The results exceeded expectations. Highly recommend!"
  },
  {
    "name": "Masud",
    "date": "February 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "The team worked on building a clone of the Shopify Theme Builder and it was a great success. They worked hard to ensure the clone was as close to the original as possible and the results were outstanding."
  },
  {
    "name": "Masud",
    "date": "February 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "Marcus understands everything very quickly and tries to make things as easy as possible for me to understand. Also answers questions effectively. \n\nHelped me understand how shopify web builder works and started building it using rails."
  },
  {
    "name": "Jaredhensley",
    "date": "February 2018",
    "avatar": "J",
    "text": "He's always willing to go the extra mile to make sure you're satisfied! His expertise and enthusiasm make him an invaluable asset."
  },
  {
    "name": "Brad Hemmerick",
    "date": "January 2018",
    "avatar": "B",
    "text": "He is an amazing teacher - he explains everything so clearly and makes programming so much easier to understand!"
  },
  {
    "name": "Nikola Chubrich",
    "date": "January 2018",
    "avatar": "https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg",
    "text": "I had no idea what to expect, but am so glad I decided to take the plunge. It was an amazing experience and I'm so glad I did it!"
  },
  {
    "name": "Jacob",
    "date": "January 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/X7o8JNazQsmaMvAhKT99",
    "text": "This was a great help! The customer service was friendly and knowledgeable, and I really appreciate their assistance."
  },
  {
    "name": "Masud",
    "date": "January 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "Marcus did a great job helping me clean up my controllers and models. His advice was very clear and his instructions were easy to understand and follow. Highly recommend!"
  },
  {
    "name": "Jacob",
    "date": "January 2018",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/X7o8JNazQsmaMvAhKT99",
    "text": "He was very knowledgeable and gave me helpful advice. He was very accommodating and was willing to go the extra mile to help. Highly recommend!"
  },
  {
    "name": "Ryan",
    "date": "January 2018",
    "avatar": "https://www.gravatar.com/avatar/7e192343ca1f4cd0173126400a6d1d0e?d=404&s=200",
    "text": "Marcus is an excellent teacher; he is able to take complex topics and break them down into easy-to-understand chunks. He makes learning fun and engaging."
  },
  {
    "name": "Masud",
    "date": "January 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "The experience working on the codementor.io timer clone was great. It was a challenging task, but I was able to complete it in a timely manner. The end result was a fully functional clone with a few additional features. Overall, it was a great experience."
  },
  {
    "name": "Masud",
    "date": "January 2018",
    "avatar": "https://ucarecdn.com/c82b1dc4-3509-42da-99a8-397270ff0f54/",
    "text": "This project is an exciting combination of React, Rails, and ActionCables to create a codementor timer. We're looking forward to seeing the results!"
  },
  {
    "name": "Marcos Icaza",
    "date": "December 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/t5g57RaSIyT7hCJOM9C2",
    "text": "He is an exceptional coder – honest, fair and with outstanding technical skills. Highly recommended!"
  },
  {
    "name": "Suyesh Bhandari",
    "date": "December 2017",
    "avatar": "https://www.gravatar.com/avatar/8f4e5aa2787c65782cf359db90a24a9c?d=404&s=200",
    "text": "Awesome First session. Learnt much more than i was anticipating. Very knowledgable about the topic, And very thorough"
  },
  {
    "name": "Anthony Cambece",
    "date": "December 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/vOiuF3sfQ9ymoRaaGSHx",
    "text": "his coaching is great! It exceeded my expectations and I'm very happy with it. The quality is top notch and it's exactly what I wanted. Highly recommended!"
  },
  {
    "name": "Anthony Cambece",
    "date": "December 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/vOiuF3sfQ9ymoRaaGSHx",
    "text": "He was an amazing mentor - always willing to go the extra mile to help me achieve my goals. His knowledge and enthusiasm were unparalleled."
  },
  {
    "name": "Anthony Cambece",
    "date": "December 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/vOiuF3sfQ9ymoRaaGSHx",
    "text": "You did an awesome job! You should be proud of yourself for the hard work you put in. Well done!"
  },
  {
    "name": "Jin-Soo.",
    "date": "November 2017",
    "avatar": "R",
    "text": "Marcus is a great mentor! He's super knowledgable and as a student I appreciate his ability to explain concepts clearly. I can tell he really cares about my learning and progress. He is fair and makes sure I'm getting value from our sessions. Highly recommended!"
  },
  {
    "name": "Daniel",
    "date": "November 2017",
    "avatar": "D",
    "text": "The instructor was amazing and the session was super helpful! He provided great explanations of the logic and made the session both informative and enjoyable."
  },
  {
    "name": "Daniel",
    "date": "November 2017",
    "avatar": "D",
    "text": "Great Rails and React session! Very knowledgeable and a great mentor!! I understand everything and we go over all the items in a very clear way. Thank you!!"
  },
  {
    "name": "Daniel",
    "date": "November 2017",
    "avatar": "D",
    "text": "Always a pleasure to work with this mentor! Always available to answer questions and provide helpful feedback. Highly recommend!"
  },
  {
    "name": "Edwin van Brenkelen",
    "date": "October 2017",
    "avatar": "E",
    "text": "Marcus quickly constructed a robust solution for a javascript project after I explained what I needed."
  },
  {
    "name": "Daniel",
    "date": "October 2017",
    "avatar": "D",
    "text": "It was another fantastic session with Marcus! He's an amazing Ruby on Rails mentor and I'm so grateful for his help. Highly recommended!"
  },
  {
    "name": "Daniel",
    "date": "October 2017",
    "avatar": "D",
    "text": "Awesome!! Marcus is a very talented developer and a great teacher! He identifies the way to build it, the right way, and makes sure to explain it in detail. Thanks!"
  },
  {
    "name": "Reginald Bellas",
    "date": "September 2017",
    "avatar": "https://lh6.googleusercontent.com/-laKf6LR6vDg/AAAAAAAAAAI/AAAAAAAAAE0/80D1FnFssxE/photo.jpg",
    "text": "He is an excellent mentor who is very knowledgeable and truly an expert in his field. I'm looking forward to learning from him."
  },
  {
    "name": "Alexander JK Garber",
    "date": "September 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/bjklFeRR6OuzNNiEysAc",
    "text": "Marcus helped me get set up to send emails from the Rails console, which is exactly what I wanted, and what's more we got it done in just a couple of minutes.  No hassle, straight to the point."
  },
  {
    "name": "steve chek",
    "date": "August 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus is very knowledgable mentor and he knows how to solve any kind of technical problem. he is very passionate about React and Rails. If you want to have deep understanding of React and Rails Marcus is the mentor for you!!!"
  },
  {
    "name": "Anthony Carrillo",
    "date": "July 2017",
    "avatar": "A",
    "text": "He was very knowledgeable and patient when explaining how to use the app. He was also quick to respond to any questions I had and very willing to help. Highly recommend!"
  },
  {
    "name": "Gaurav Chaturvedi",
    "date": "July 2017",
    "avatar": "https://www.gravatar.com/avatar/d74a79fcfcf22fad871a5bede0bdd568?d=404&s=200",
    "text": "The tutor was fantastic! He was very knowledgeable and patient, and was great at breaking down complex concepts and giving helpful advice. Highly recommended!"
  },
  {
    "name": "Josh Goldman",
    "date": "July 2017",
    "avatar": "J",
    "text": "Marcus took the time to understand what I needed help with and we got right to it. He gave helpful hints along the way while accomplishing what I need to get done in a timely matter."
  },
  {
    "name": "Grant Spilsbury",
    "date": "June 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/4eXkls72SUK64CKqsacO",
    "text": "Marcus did an excellent job - he was courteous, professional, and went above and beyond expectations. Highly recommend!"
  },
  {
    "name": "John Dinker",
    "date": "June 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/VmACSAXFRnKd19fz3Lsk",
    "text": "Marcus's help was invaluable! I'm so grateful he was able to solve my touch gesture issue, which had been a thorn in my side for months. Thank you Marcus!"
  },
  {
    "name": "Anthony Carrillo",
    "date": "June 2017",
    "avatar": "A",
    "text": "Marcus was very helpful and had a lot of extra advice that gave me a better perspective of looking at coding."
  },
  {
    "name": "Michael Porter",
    "date": "June 2017",
    "avatar": "https://i.stack.imgur.com/tRo5b.jpg?s=128&g=1",
    "text": "I was really impressed by the efficiency of this session, it was great how quickly we got to the heart of the matter and I was really helped out."
  },
  {
    "name": "Edwin van Brenkelen",
    "date": "June 2017",
    "avatar": "E",
    "text": "He was very knowledgeable and patient, providing clear guidance and support throughout the process. I'm grateful for his help and would highly recommend him as a mentor."
  },
  {
    "name": "steve chek",
    "date": "May 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Awesome Mentor super friendly amazing debugger can help you solve any problem at fast paced and will make sure you learn as well. Highly recommended!!!"
  },
  {
    "name": "carmine K",
    "date": "May 2017",
    "avatar": "C",
    "text": "He was very knowledgeable and patient in helping me find a solution. He was very supportive and encouraging throughout the entire process."
  },
  {
    "name": "Hrvoje Kurtovic",
    "date": "May 2017",
    "avatar": "H",
    "text": "Marcus is a true professional! Top-notch work and highly recommend to anyone looking for quality service. He's a real asset!"
  },
  {
    "name": "steve chek",
    "date": "May 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "He was an excellent guide, providing valuable advice and encouragement while helping us create an app. Working with him was a great learning experience."
  },
  {
    "name": "Hans K",
    "date": "May 2017",
    "avatar": "H",
    "text": "This review was a great sanity check. Quick and clear, it gave me an overview of the topic at hand. Highly recommend!"
  },
  {
    "name": "Ayesha",
    "date": "May 2017",
    "avatar": "A",
    "text": "I was very impressed with the first session - the instructor was knowledgeable, engaging, and very patient. It was a great start to the course!"
  },
  {
    "name": "Nawar Yossef",
    "date": "May 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/YGDZegARQCb8NSq5rK4V",
    "text": "This was an amazing experience. The staff was so friendly and helpful, and the food was delicious! I highly recommend it!"
  },
  {
    "name": "steve chek",
    "date": "April 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus was very helpful we been working on a project together and he is very excited and passionate to solve problems and teach. i HIGHLY recommend Marcus to anybody who wants to build a project while learning!!!"
  },
  {
    "name": "Yves Creemers",
    "date": "March 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/ty7jPOj3QK6Ruu2XjyDj",
    "text": "He's great to work with and always has a wealth of information. He's an asset to any team!"
  },
  {
    "name": "steve chek",
    "date": "March 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus was great at debugging HTML and CSS problems and helping to implement them into our Rails application. He was very knowledgeable and was able to quickly identify and solve any issues. Highly recommended!"
  },
  {
    "name": "Eric",
    "date": "March 2017",
    "avatar": "E",
    "text": "He was very knowledgeable and gave clear, concise instructions to help me debug my JavaScript issue. He was friendly and responded quickly. Highly recommend!"
  },
  {
    "name": "steve chek",
    "date": "February 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "great session with Marcus he has a lot of knowledge using ruby on rails and CSS helped me to debug problems and understand them. Thank you Marcus!!!"
  },
  {
    "name": "steve chek",
    "date": "February 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Super helpful session with marcus have taught me a lot building social networking website with rails. He has a lot of knowledge and passionate about teaching!!!"
  },
  {
    "name": "steve chek",
    "date": "February 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus is an amazing mentor, guiding me every step of the way as I built calendar events from scratch. His knowledge and experience are invaluable!"
  },
  {
    "name": "Carl Lewis",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/1583872fbd7ce72f4bab2a3a7335d6d6?d=404&s=200",
    "text": "Marcus is a straight boss. The man knows his stuff and I will definitely use him as a mento going forward.."
  },
  {
    "name": "steve chek",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Very passionate and motivated when it comes to working on Rails projects, able to keep up with a fast-paced environment!"
  },
  {
    "name": "Felipe del Sol",
    "date": "January 2017",
    "avatar": "F",
    "text": "He was such a great mentor! He was so passionate and knowledgeable and he really helped me to understand. Highly recommend!"
  },
  {
    "name": "Jason Casares",
    "date": "January 2017",
    "avatar": "J",
    "text": "He is a great mentor - always providing thoughtful guidance and helpful advice. He is patient and encouraging, making sure I have the resources and support I need to reach my goals."
  },
  {
    "name": "Diana Eastman",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/2c64b1170998cf97567f3ade5e1276d2?d=404&s=200",
    "text": "I'm so glad I attended the session - it was incredibly helpful and I now have a clear idea of what I need to do next. Highly recommend!"
  },
  {
    "name": "steve chek",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus is an awesome mentor and a great teacher he gives me assignment to do on my own and make sure i understand the material. He is an amazing Ruby developer. Highly Recommended."
  },
  {
    "name": "Adam Stockland",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/1309fa08e230c6cbe9a2b27964a40516?d=404&s=200",
    "text": "Marcus is an excellent tutor! He is patient, knowledgeable, and always willing to help. I highly recommend him and will definitely be using his services again."
  },
  {
    "name": "steve chek",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus is an amazing teacher who takes the time to ensure that all of his students understand the material. He works efficiently and is always willing to answer questions. Highly recommended!"
  },
  {
    "name": "Jack Zerby",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/4b097e8c65fd359862d0eb886d28f6d0?d=404&s=200",
    "text": "This software has been a lifesaver! It saved me countless hours of trying to figure out complex SQL queries. Highly recommend!"
  },
  {
    "name": "Jesse Ramon Brown",
    "date": "January 2017",
    "avatar": "J",
    "text": "he is incredibly knowledgeable and patient with explaining concepts. he won't leave until you understand the material completely and provides lots of helpful resources."
  },
  {
    "name": "Bill Wagner",
    "date": "January 2017",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/2h5GfwB8TdOMurlaJHeY",
    "text": "Thanks for not charging me until you could solve the problem and also taking the extra time to teach me stuff"
  },
  {
    "name": "Jason Casares",
    "date": "January 2017",
    "avatar": "J",
    "text": "He's an amazing mentor - very knowledgeable and helpful. He's great at providing guidance and support. Highly recommend!"
  },
  {
    "name": "steve chek",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Super Mentor and very honest. helped me with a rails project and explain me in details. made sure i understood the material. Highly recommended!!!"
  },
  {
    "name": "steve chek",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/82c0e8d3debbf3c0d0481a0f4d5431c4?d=404&s=200",
    "text": "Marcus was a great Mentor taught me a lot and helped me to fix and debug problems related to Ruby. He is super helpful and highly recommended to anybody who want to learn and build applications."
  },
  {
    "name": "Ryan",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/9de77d1eb5129c82eaf7588bfcb6bb78?d=404&s=200",
    "text": "He made us feel at ease and was very knowledgeable . His customer service was excellent!"
  },
  {
    "name": "Jack Zerby",
    "date": "January 2017",
    "avatar": "https://www.gravatar.com/avatar/4b097e8c65fd359862d0eb886d28f6d0?d=404&s=200",
    "text": "his coaching was a lifesaver! It saved me so much time and effort. I'm so glad I decided to give it a try!"
  },
  {
    "name": "Tiffany Sumuel",
    "date": "December 2016",
    "avatar": "T",
    "text": "He always takes the time to explain why the solution he suggested works and is willing to help you work through it until you understand."
  },
  {
    "name": "Bradley",
    "date": "December 2016",
    "avatar": "https://www.gravatar.com/avatar/696bf107459919d14d2d61af7c5e03d2?d=404&s=200",
    "text": "He provided great solutions and was always available to answer any questions. Highly recommend!"
  },
  {
    "name": "Gonzalo Reutter",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/h6XE6SgQiKnOz4whmLLI",
    "text": "Marcus was spot on with his solution. The problem has been successfully addressed and resolved."
  },
  {
    "name": "Gonzalo Reutter",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/h6XE6SgQiKnOz4whmLLI",
    "text": "He is knowledgeable and has a great teaching style. Definitely looking forward to a long-term mentorship with Marcus!"
  },
  {
    "name": "Nonni",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/CIS6shPvSx2bDYhnaOze",
    "text": "Marcus was extremely helpful. Not only did he take the time to understand the problem before starting the session, he explained what he was doing and why during the session and also paused the session once it became clear that I could move forward on my own. \n\nI recommend him 100%."
  },
  {
    "name": "Gonzalo Reutter",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/h6XE6SgQiKnOz4whmLLI",
    "text": "Marcus solved all the technical problems I planned for the session. Also he explain the concepts of what he was doing. Really helpful. \n\nWould recommend."
  },
  {
    "name": "Daniel",
    "date": "December 2016",
    "avatar": "D",
    "text": "Such a great mentor! Explained everything so clearly and made sure I fully understood. Really appreciate the help! Thanks!"
  },
  {
    "name": "Jack Zerby",
    "date": "December 2016",
    "avatar": "https://www.gravatar.com/avatar/4b097e8c65fd359862d0eb886d28f6d0?d=404&s=200",
    "text": "This was a great experience! Marcus was friendly, professional and knowledgeable. Highly recommend!"
  },
  {
    "name": "Angelis Pseftis",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/VIV7laySWwRTo8riDHtQ",
    "text": "He is an incredible teacher and a gifted professional. His expertise and guidance have been invaluable to me. Highly recommend!"
  },
  {
    "name": "hh",
    "date": "December 2016",
    "avatar": "H",
    "text": "Marcus was super helpful! Very experienced and clearly knows what he's talking about. Would highly reccommend."
  },
  {
    "name": "Mike Wiesenhart",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/EocgFxwZQE18Ovn85Epq",
    "text": "Marcus is an absolute pleasure to work with! He is friendly, knowledgeable, and always willing to go the extra mile to help. Highly recommend!"
  },
  {
    "name": "Jason Casares",
    "date": "December 2016",
    "avatar": "J",
    "text": "This was a great help! The explanations were clear and concise, making it easy to understand. Highly recommend!"
  },
  {
    "name": "Marcus Pfeffer",
    "date": "December 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/YMlrzPKXSFqS7wwFgazA",
    "text": "Really knowledgeable mentor. Great personality and really knows what he's talking about. Would highly recommend!"
  },
  {
    "name": "Jamil Brown",
    "date": "November 2016",
    "avatar": "J",
    "text": "He was able to help me understand difficult concepts and was patient and encouraging throughout the process. Highly recommend!"
  },
  {
    "name": "Nick W",
    "date": "November 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/giYRdqzSDelvLBOlOunh",
    "text": "Great session with Marcus - very knowledgeable about solving Rails problems as well as best practices to adopt. Highly recommended, I'll be back with more questions for sure!"
  },
  {
    "name": "Michael",
    "date": "November 2016",
    "avatar": "https://process.filestackapi.com/cache=expiry:max/resize=width:72/bXtjeJPSyJSCsWG0UxNQ",
    "text": "The support team was extremely helpful and solved my issue with lightning speed. They were friendly and professional and I'm extremely satisfied with the outcome."
  }
]